MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
/**
  ******************************************************************************
  * @file    kms_ext_token_stsafe.c
  * @author  SMD/AME application teams
  * @brief   Key Management Services module, external token plug-in.
  *          This file includes an implementation of PKCS11 APIs for STSAFE-A1xx.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2016 STMicroelectronics</center></h2>
  *
  * STSAFE DRIVER SOFTWARE LICENSE AGREEMENT (SLA0088)
  *
  * BY INSTALLING, COPYING, DOWNLOADING, ACCESSING OR OTHERWISE USING THIS SOFTWARE
  * OR ANY PART THEREOF (AND THE RELATED DOCUMENTATION) FROM STMICROELECTRONICS
  * INTERNATIONAL N.V, SWISS BRANCH AND/OR ITS AFFILIATED COMPANIES (STMICROELECTRONICS),
  * THE RECIPIENT, ON BEHALF OF HIMSELF OR HERSELF, OR ON BEHALF OF ANY ENTITY BY WHICH
  * SUCH RECIPIENT IS EMPLOYED AND/OR ENGAGED AGREES TO BE BOUND BY THIS SOFTWARE LICENSE
  * AGREEMENT.
  *
  * Under STMicroelectronics’ intellectual property rights, the redistribution,
  * reproduction and use in source and binary forms of the software or any part thereof,
  * with or without modification, are permitted provided that the following conditions
  * are met:
  * 1.  Redistribution of source code (modified or not) must retain any copyright notice,
  *     this list of conditions and the disclaimer set forth below as items 10 and 11.
  * 2.  Redistributions in binary form, except as embedded into a microcontroller or
  *     microprocessor device or a software update for such device, must reproduce any
  *     copyright notice provided with the binary code, this list of conditions, and the
  *     disclaimer set forth below as items 10 and 11, in documentation and/or other
  *     materials provided with the distribution.
  * 3.  Neither the name of STMicroelectronics nor the names of other contributors to this
  *     software may be used to endorse or promote products derived from this software or
  *     part thereof without specific written permission.
  * 4.  This software or any part thereof, including modifications and/or derivative works
  *     of this software, must be used and execute solely and exclusively in combination
  *     with a secure microcontroller device from STSAFE family manufactured by or for
  *     STMicroelectronics.
  * 5.  No use, reproduction or redistribution of this software partially or totally may be
  *     done in any manner that would subject this software to any Open Source Terms.
  *     “Open Source Terms” shall mean any open source license which requires as part of
  *     distribution of software that the source code of such software is distributed
  *     therewith or otherwise made available, or open source license that substantially
  *     complies with the Open Source definition specified at www.opensource.org and any
  *     other comparable open source license such as for example GNU General Public
  *     License(GPL), Eclipse Public License (EPL), Apache Software License, BSD license
  *     or MIT license.
  * 6.  STMicroelectronics has no obligation to provide any maintenance, support or
  *     updates for the software.
  * 7.  The software is and will remain the exclusive property of STMicroelectronics and
  *     its licensors. The recipient will not take any action that jeopardizes
  *     STMicroelectronics and its licensors' proprietary rights or acquire any rights
  *     in the software, except the limited rights specified hereunder.
  * 8.  The recipient shall comply with all applicable laws and regulations affecting the
  *     use of the software or any part thereof including any applicable export control
  *     law or regulation.
  * 9.  Redistribution and use of this software or any part thereof other than as  permitted
  *     under this license is void and will automatically terminate your rights under this
  *     license.
  * 10. THIS SOFTWARE IS PROVIDED BY STMICROELECTRONICS AND CONTRIBUTORS "AS IS" AND ANY
  *     EXPRESS, IMPLIED OR STATUTORY WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
  *     WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT
  *     OF THIRD PARTY INTELLECTUAL PROPERTY RIGHTS, WHICH ARE DISCLAIMED TO THE FULLEST
  *     EXTENT PERMITTED BY LAW. IN NO EVENT SHALL STMICROELECTRONICS OR CONTRIBUTORS BE
  *     LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  *     DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
  *     LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY
  *     THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING
  *     NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF
  *     ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  * 11. EXCEPT AS EXPRESSLY PERMITTED HEREUNDER, NO LICENSE OR OTHER RIGHTS, WHETHER EXPRESS
  *     OR IMPLIED, ARE GRANTED UNDER ANY PATENT OR OTHER INTELLECTUAL PROPERTY RIGHTS OF
  *     STMICROELECTRONICS OR ANY THIRD PARTY.
  ******************************************************************************
  */

/* Includes ------------------------------------------------------------------*/
#include <stdint.h>
#include "string.h"
#include "pkcs11.h"

#include "stm32l4xx.h"

/*STSAFE Drivers*/
#include "stsafea_conf.h"
#include "stsafea_types.h"
#include "stsafea_core.h"
#include "stsafea_interface_conf.h"

/* KSM Includes*/
#include "kms_ext_token.h"
#include "kms_platf_objects_interface.h"
#include "stsafe_platf_objects.h"
#include "stsafe_platf_objects_config.h"

/* Private typedef -----------------------------------------------------------*/

typedef struct
{
  CK_SESSION_HANDLE   SessionHandle;                                   /*!< Session Handle */
  CK_SESSION_INFO     SessionInfo;                                     /*!< Session Info */
  CK_BBOOL            OperationActive;                                 /*!< Operation Status */
  CK_OBJECT_HANDLE    OperationObjects[STSAFE_P11_NUMBER_OBJECTS];     /*!< List of operation objects */
  CK_ULONG            ulOperationObjectsCount;                         /*!< N of valid operation object handles*/
} STSAFE_P11_SessionTypeDef;

/* Private defines -----------------------------------------------------------*/
#define STSAFE_P11_NB_SESSIONS_MAX          1UL           /*!< STSAFE P11 Max number of sessions*/
#define STSAFE_P11_SESSION_INDEX_OFFSET     1UL           /*!< STSAFE P11 session index Offset*/
#define STSAFE_RANDOM_MAX_LEN               0xFFU         /*!< STSAFE Max random length */

#define ASN_OCTET_STRING                    0x04U         /*!< ASN OCTET STRING  tag */
#define ASN_SEQUENCE                        0x30U         /*!< ASN SEQUENCE  tag */
#define ASN_LONG_LEN                        0x80U         /*!< ASN LONG length tag */
#define DER_UNCOMPRESSED                    0x04U         /*!< DER Uncompressed tag */
/* Private macros ------------------------------------------------------------*/
#define __STSAFEA_GET_SLOT_ID_FROM_CK(__CKE_PRVKEY_SLOTx_PTR__) \
  (((*((CK_EXT_TOKEN_PRVKEY_SLOT *)__CKE_PRVKEY_SLOTx_PTR__)) == CKE_PRVKEY_SLOT0) ? STSAFEA_KEY_SLOT_0 :\
   ((*((CK_EXT_TOKEN_PRVKEY_SLOT *)__CKE_PRVKEY_SLOTx_PTR__)) == CKE_PRVKEY_SLOT1) ? STSAFEA_KEY_SLOT_1 : 0xFFU)

/* Private variables ---------------------------------------------------------*/
static StSafeA_Handle_t   hStSafe;    /*<! STSAFE Handle */
static STSAFE_P11_SessionTypeDef    a_SessionList[STSAFE_P11_NB_SESSIONS_MAX];  /*!< STSAFE P11 Session List */
static CK_ULONG ulSessionNb;    /*!< STSAFE P11 Number of open session. It can't exceed STSAFE_P11_NB_SESSIONS_MAX */
static CK_BBOOL  uInitialized = CK_FALSE;   /*!< STSAFE P11 Initialization Status. It is set to CK_TRUE calling
C_Initialize and to CK_FALSE calling C_Finalize */

