MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
/* Sensitive Attribute List - used to filter sensitive attributes when calling C_GetAttributeValue*/
/*CKO_PRIVATE_KEY objects - extractable / not extractable objects*/
static CK_ATTRIBUTE_TYPE a_SensAttList_CkoPrivateKey_NotExtr[] = {CKA_VALUE,
                                                                  CKA_EXT_TOKEN_PRVKEY_SLOT,
                                                                  CKA_VENDOR_SESSION_HANDLE
                                                                 };
static CK_ULONG SensAttList_CkoPrivateKey_NotExtrLen =  sizeof(a_SensAttList_CkoPrivateKey_NotExtr) /
                                                        sizeof(CK_ATTRIBUTE_TYPE);
static CK_ATTRIBUTE_TYPE a_SensAttList_CkoPrivateKey_Extr[] = { CKA_EXT_TOKEN_PRVKEY_SLOT,
                                                                CKA_VENDOR_SESSION_HANDLE
                                                              };
static CK_ULONG SensAttList_CkoPrivateKey_ExtrLen =  sizeof(a_SensAttList_CkoPrivateKey_Extr) /
                                                     sizeof(CK_ATTRIBUTE_TYPE);

/*CKO_SECRETE_KEY objects - extractable / not extractable objects*/
static CK_ATTRIBUTE_TYPE a_SensAttList_CkoSecretKey_NotExtr[] = {CKA_VALUE,
                                                                 CKA_VENDOR_SESSION_HANDLE
                                                                };
static CK_ULONG SensAttList_CkoSecretKey_NotExtr =  sizeof(a_SensAttList_CkoSecretKey_NotExtr) /
                                                    sizeof(CK_ATTRIBUTE_TYPE);
static CK_ATTRIBUTE_TYPE a_SensAttList_CkoSecretKey_Extr[] = {CKA_VENDOR_SESSION_HANDLE};
static CK_ULONG SensAttList_CkoSecretKey_ExtrLen =  sizeof(a_SensAttList_CkoSecretKey_Extr) /
                                                    sizeof(CK_ATTRIBUTE_TYPE);

/*CKO_CERTIFICATE objects - all objects are extractable*/
static CK_ATTRIBUTE_TYPE a_SensitiveAttributesList_CkoCertificate[] = {CKA_EXT_TOKEN_ZONE, CKA_EXT_TOKEN_ZONE_AC,
                                                                       CKA_VENDOR_SESSION_HANDLE
                                                                      };
static CK_ULONG SensitiveAttributesList_CkoCertificateLen = sizeof(a_SensitiveAttributesList_CkoCertificate) /
                                                            sizeof(CK_ATTRIBUTE_TYPE);

/*CKO_PUBLIC_KEY objects - all objects are extractable*/
static CK_ATTRIBUTE_TYPE a_SensitiveAttributesList_CkoPublicKey[] = {CKA_VENDOR_SESSION_HANDLE};
static CK_ATTRIBUTE_TYPE SensitiveAttributesList_CkoPublicKeyLen = sizeof(a_SensitiveAttributesList_CkoPublicKey) /
                                                                   sizeof(CK_ATTRIBUTE_TYPE);

/* Global variables ----------------------------------------------------------*/

/* Private function prototypes -----------------------------------------------*/
/** @addtogroup Utils_Private_Functions
  * @{
  */
/* Session */
static CK_RV    SessionInit(void);
static CK_RV    SessionOpen(CK_SLOT_ID slotID, CK_FLAGS flags, CK_VOID_PTR pApplication,  CK_NOTIFY Notif,
                            CK_SESSION_HANDLE_PTR phSession);
static CK_RV    SessionClose(CK_SESSION_HANDLE hSession);
static CK_RV    SessionIsValid(CK_SESSION_HANDLE hSession);
static CK_RV    SessionIsOpen(CK_SESSION_HANDLE hSession);
static CK_RV    SessionOperationIsActive(CK_SESSION_HANDLE hSession);
static CK_RV    SessionOperationSetObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR pObject, CK_ULONG ulCount);
static CK_RV    SessionOperationGetObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR pObject,
                                           CK_ULONG ulMaxObjectCount, CK_ULONG_PTR pulObjectCount);
static CK_RV    SessionOperationFinish(CK_ULONG ulSessionIndex);
/* Objects / Attributes */
static CK_RV    ObjectSetSession(CK_OBJECT_HANDLE hObject, CK_SESSION_HANDLE hSession);
static CK_RV    FindObjectsFromTemplate(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR phObject, CK_ULONG ulMaxCount,
                                        CK_ULONG_PTR pulObjectCount,  CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_RV    GetAttributeValueFromTemplate(CK_BYTE_PTR pValue,  CK_ULONG_PTR pulValueLen, CK_ATTRIBUTE_TYPE Type,
                                              CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_BBOOL IsMechanismTypeAllowed(CK_MECHANISM_TYPE MechanismIn, CK_MECHANISM_PTR  pMechanism,
                                       CK_ULONG ulValueLen);
static CK_BBOOL IsAttributeSensitive(CK_ATTRIBUTE_TYPE Type, CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_BBOOL IsAttributeTypeInList(CK_ATTRIBUTE_TYPE Type, CK_ATTRIBUTE_TYPE *pAttributeList, CK_ULONG ulCount);
/*StSafe Read*/
static CK_RV StSafeReadZone(uint8_t uZone, uint32_t ulOffset, uint8_t *pucData, uint32_t ulDataSize,
                            uint8_t AccessCondition);
static CK_RV StSafeReadCertificate(uint8_t *pValue, uint32_t *pulValueLen, uint8_t Zone, uint8_t AccessCondition);
/* Parsing */
static CK_RV DecodeDerASN1OctetString(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn,
                                      CK_ULONG ulValueInLen);
static CK_RV DecodeDerASN1UncompressedEcPoint(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn,
                                              CK_ULONG ulValueInLen);
static CK_RV EncodeRawToDerASN1UncompressedEcPoint(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen,
                                                   CK_BYTE_PTR pValueIn, CK_ULONG ulValueInLen);
static CK_RV GetLenDerASN1SequenceHeader(CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn, CK_ULONG ulValueInLen);
/**
  * @}
  */

/** @addtogroup P11_Private_Functions
  * @{
  */
static CK_RV STSAFE_P11_Initialize(CK_VOID_PTR pInitArgs);
static CK_RV STSAFE_P11_Finalize(CK_VOID_PTR pReserved);
static CK_RV STSAFE_P11_GetInfo(CK_INFO_PTR pInfo);
/* Slot and token management */
static CK_RV STSAFE_P11_GetSlotList(CK_BBOOL tokenPresent, CK_SLOT_ID_PTR pSlotList, CK_ULONG_PTR pulCount);
static CK_RV STSAFE_P11_GetSlotInfo(CK_SLOT_ID slotID, CK_SLOT_INFO_PTR pInfo);
static CK_RV STSAFE_P11_GetTokenInfo(CK_SLOT_ID slotID, CK_TOKEN_INFO_PTR pInfo);
static CK_RV STSAFE_P11_GetMechanismList(CK_SLOT_ID slotID, CK_MECHANISM_TYPE_PTR pMechanismList,
                                         CK_ULONG_PTR pulCount);
static CK_RV STSAFE_P11_GetMechanismInfo(CK_SLOT_ID slotID, CK_MECHANISM_TYPE type, CK_MECHANISM_INFO_PTR pInfo);
static CK_RV STSAFE_P11_InitToken(CK_SLOT_ID slotID, CK_UTF8CHAR_PTR pPin, CK_ULONG ulPinLen, CK_UTF8CHAR_PTR pLabel);
static CK_RV STSAFE_P11_InitPIN(CK_SESSION_HANDLE hSession, CK_UTF8CHAR_PTR pPin, CK_ULONG ulPinLen);
static CK_RV STSAFE_P11_SetPIN(CK_SESSION_HANDLE hSession, CK_UTF8CHAR_PTR pOldPin, CK_ULONG ulOldLen,
                               CK_UTF8CHAR_PTR pNewPin, CK_ULONG ulNewLen);
/* Session management */
static CK_RV STSAFE_P11_OpenSession(CK_SLOT_ID slotID, CK_FLAGS flags, CK_VOID_PTR pApplication, CK_NOTIFY Notify,
                                    CK_SESSION_HANDLE_PTR phSession);
static CK_RV STSAFE_P11_CloseSession(CK_SESSION_HANDLE hSession);
static CK_RV STSAFE_P11_CloseAllSessions(CK_SLOT_ID slotID);
static CK_RV STSAFE_P11_GetSessionInfo(CK_SESSION_HANDLE hSession, CK_SESSION_INFO_PTR pInfo);
static CK_RV STSAFE_P11_GetOperationState(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pOperationState,
                                          CK_ULONG_PTR pulOperationStateLen);
static CK_RV STSAFE_P11_SetOperationState(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pOperationState,
                                          CK_ULONG ulOperationStateLen, CK_OBJECT_HANDLE hEncryptionKey,
                                          CK_OBJECT_HANDLE hAuthenticationKey);
static CK_RV STSAFE_P11_Login(CK_SESSION_HANDLE hSession, CK_USER_TYPE userType, CK_UTF8CHAR_PTR pPin,
                              CK_ULONG ulPinLen);
static CK_RV STSAFE_P11_Logout(CK_SESSION_HANDLE hSession);
/* Object management */
static CK_RV STSAFE_P11_CreateObject(CK_SESSION_HANDLE hSession, CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount,
                                     CK_OBJECT_HANDLE_PTR phObject);
static CK_RV STSAFE_P11_CopyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ATTRIBUTE_PTR pTemplate,
                                   CK_ULONG ulCount, CK_OBJECT_HANDLE_PTR phNewObject);
static CK_RV STSAFE_P11_DestroyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject);
static CK_RV STSAFE_P11_GetObjectSize(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ULONG_PTR pulSize);
static CK_RV STSAFE_P11_GetAttributeValue(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject,
                                          CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_RV STSAFE_P11_SetAttributeValue(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject,
                                          CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_RV STSAFE_P11_FindObjectsInit(CK_SESSION_HANDLE hSession, CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount);
static CK_RV STSAFE_P11_FindObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR phObject,
                                    CK_ULONG ulMaxObjectCount, CK_ULONG_PTR pulObjectCount);
static CK_RV STSAFE_P11_FindObjectsFinal(CK_SESSION_HANDLE hSession);
/* Encryption and decryption */
static CK_RV STSAFE_P11_EncryptInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_Encrypt(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen,
                                CK_BYTE_PTR pEncryptedData, CK_ULONG_PTR pulEncryptedDataLen);
static CK_RV STSAFE_P11_EncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                      CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen);
static CK_RV STSAFE_P11_EncryptFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pLastEncryptedPart,
                                     CK_ULONG_PTR pulLastEncryptedPartLen);
static CK_RV STSAFE_P11_DecryptInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_Decrypt(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedData, CK_ULONG ulEncryptedDataLen,
                                CK_BYTE_PTR pData, CK_ULONG_PTR pulDataLen);
static CK_RV STSAFE_P11_DecryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                      CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen);
static CK_RV STSAFE_P11_DecryptFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pLastPart, CK_ULONG_PTR pulLastPartLen);
/* Message digesting */
static CK_RV STSAFE_P11_DigestInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism);
static CK_RV STSAFE_P11_Digest(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen, CK_BYTE_PTR pDigest,
                               CK_ULONG_PTR pulDigestLen);
static CK_RV STSAFE_P11_DigestUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen);
static CK_RV STSAFE_P11_DigestKey(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_DigestFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pDigest, CK_ULONG_PTR pulDigestLen);
/* Signing and MACing */
static CK_RV STSAFE_P11_SignInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_Sign(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen, CK_BYTE_PTR pSignature,
                             CK_ULONG_PTR pulSignatureLen);
static CK_RV STSAFE_P11_SignUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen);
static CK_RV STSAFE_P11_SignFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG_PTR pulSignatureLen);
static CK_RV STSAFE_P11_SignRecoverInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_SignRecover(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen,
                                    CK_BYTE_PTR pSignature, CK_ULONG_PTR pulSignatureLen);
/* Verifying signatures and MACs */
static CK_RV STSAFE_P11_VerifyInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_Verify(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen,
                               CK_BYTE_PTR pSignature, CK_ULONG ulSignatureLen);
static CK_RV STSAFE_P11_VerifyUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen);
static CK_RV STSAFE_P11_VerifyFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG ulSignatureLen);
static CK_RV STSAFE_P11_VerifyRecoverInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                          CK_OBJECT_HANDLE hKey);
static CK_RV STSAFE_P11_VerifyRecover(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG ulSignatureLen,
                                      CK_BYTE_PTR pData, CK_ULONG_PTR pulDataLen);
/* Dual-function cryptographic operations */
static CK_RV STSAFE_P11_DigestEncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                            CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen);
static CK_RV STSAFE_P11_DecryptDigestUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                            CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen);
static CK_RV STSAFE_P11_SignEncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                          CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen);
static CK_RV STSAFE_P11_DecryptVerifyUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                            CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen);
/* Key management */
static CK_RV STSAFE_P11_GenerateKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_ATTRIBUTE_PTR pTemplate,
                                    CK_ULONG ulCount, CK_OBJECT_HANDLE_PTR phKey);
static CK_RV STSAFE_P11_GenerateKeyPair(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                        CK_ATTRIBUTE_PTR pPublicKeyTemplate, CK_ULONG ulPublicKeyAttributeCount,
                                        CK_ATTRIBUTE_PTR pPrivateKeyTemplate,
                                        CK_ULONG ulPrivateKeyAttributeCount, CK_OBJECT_HANDLE_PTR phPublicKey,
                                        CK_OBJECT_HANDLE_PTR phPrivateKey);
static CK_RV STSAFE_P11_WrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hWrappingKey,
                                CK_OBJECT_HANDLE hKey, CK_BYTE_PTR pWrappedKey, CK_ULONG_PTR pulWrappedKeyLen);
static CK_RV STSAFE_P11_UnwrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                  CK_OBJECT_HANDLE hUnwrappingKey, CK_BYTE_PTR pWrappedKey, CK_ULONG ulWrappedKeyLen,
                                  CK_ATTRIBUTE_PTR pTemplate,
                                  CK_ULONG ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey);
static CK_RV STSAFE_P11_DeriveKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hBaseKey,
                                  CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey);
/* Random number generation */
static CK_RV STSAFE_P11_SeedRandom(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSeed, CK_ULONG ulSeedLen);
static CK_RV STSAFE_P11_GenerateRandom(CK_SESSION_HANDLE hSession, CK_BYTE_PTR RandomData, CK_ULONG ulRandomLen);
/* Parallel function management */
static CK_RV STSAFE_P11_GetFunctionStatus(CK_SESSION_HANDLE hSession);
static CK_RV STSAFE_P11_CancelFunction(CK_SESSION_HANDLE hSession);
static CK_RV STSAFE_P11_WaitForSlotEvent(CK_FLAGS flags, CK_SLOT_ID_PTR pSlot, CK_VOID_PTR pRserved);

/**
  * @}
  */

/* Functions Definition ------------------------------------------------------*/

/**
  * @brief  C_Initialize initializes the Cryptoki library.
  * @param  pInitArgs  if this is not NULL_PTR, it gets cast to CK_C_INITIALIZE_ARGS_PTR and dereferenced
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_ALREADY_INITIALIZED, CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_Initialize(CK_VOID_PTR pvInitArgs)
{
  CK_C_INITIALIZE_ARGS_PTR p_init_args;

