MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if ((pTemplate == NULL_PTR) || (ulCount == 0UL) || (ulCount > STSAFE_P11_MAX_TEMPLATE_SIZE) || (phObject == NULL_PTR))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ======================== Prepare input template to look for pre-allocated object =================== */

  /* Since this implementation doesn't support dynamic memory allocation, the template specified in input will
    * have to match pre-allocated objects The only value that can be different is CKA_EC_POINT, the actual value
    * of the public key, that is unique per key.
    * Filter attributes so that they will not be considered when looking and comparing the template with pre-allocated
    * objects.
    */
  CK_ATTRIBUTE attribute_filter[] =  { {CKA_EC_POINT, NULL_PTR, 0}  } ;

  if (STSAFE_OBJ_FilterTemplate(p_template_filtered, &ul_count_filtered, pTemplate, ulCount, attribute_filter,
                                sizeof(attribute_filter) / sizeof(attribute_filter[0])) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ======================== Check if the object can be created =================== */
  /*  Note: In this implementation we only support creation of 256-bit or 384-bit keys used for C_Verify.
   *  Create Object can be used only to create either one of these two objects. The one selected will be
   *  overwritten.  */

  /*Init*/
  object_found = CK_FALSE;

  /*Point to the object pre-allocated for NISTP-256 bit verification key*/
  template_tmp.type = CKA_LABEL;
  template_tmp.pValue = P11_OBJ_LABEL_VER_PUB_KEY_256;

  /*Look for the object corresponding to 256-bit verification key message, 1 single object, no filter on session*/
  if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj, 1, &ul_obj_cnt, &template_tmp, 1) == CKR_OK)
  {
    /* Get a pointer to the template of the object  */
    if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, h_obj) == CKR_OK)
    {
      /*Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
      if (STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_template_embedded,
                                      ul_count_embedded) == CKR_OK)
      {
        /*All attributes of input template are consistent with the pre-allocated object*/
        object_found = CK_TRUE;
      }
    }
  }

  /*If object was not found - try with NIST-384 bit verification key*/
  if (object_found == CK_FALSE)
  {
    template_tmp.type = CKA_LABEL;
    template_tmp.pValue = P11_OBJ_LABEL_VER_PUB_KEY_384;

    /*Look for the object corresponding to 384-bit verification key message, 1 single object, no filter on session*/
    if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_obj, 1, &ul_obj_cnt, &template_tmp, 1) == CKR_OK)
    {
      /* Get a pointer to the template of the object  */
      if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, h_obj) == CKR_OK)
      {
        /*Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
        if (STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_template_embedded,
                                        ul_count_embedded) == CKR_OK)
        {
          /*All attributes of input template are consistent with the pre-allocated object*/
          object_found = CK_TRUE;
        }
      }
    }
  }

  /* Check if both templates were not ok for the input object*/
  if (object_found == CK_FALSE)
  {
    /* Return: the template specified in input can't be used to create an object for this implementation*/
    return CKR_ATTRIBUTE_TYPE_INVALID;
  }

  /* ======================== Update the pre-allocated object =================== */
  /* Input template is consistent with one of the two pre-allocated objects.
    * Overwrite the CKA_EC_POINT attribute of the pre-allocated object. */

  /* Extract CKA_EC_POINT attribute from input template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_input, CKA_EC_POINT, pTemplate, ulCount) == CKR_OK)
  {
    /* Extract CKA_EC_POINT attribute pointer from pre-allocated object template */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_embedded, CKA_EC_POINT, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Check if the pre-allocated object has enough memory to store the new input value*/
      if (p_attribute_input->ulValueLen <= p_attribute_embedded->ulValueLen)
      {
        /* Update the embedded object pValue */
        e_ret_status = STSAFE_OBJ_SetAttributeValue(p_attribute_embedded, p_attribute_input->pValue,
                                                    p_attribute_input->ulValueLen);

      }
      else
      {
        /* The pre-allocated value doesn't have enough memory to store the new value*/
        e_ret_status = CKR_DEVICE_MEMORY;
      }
    }
    else
    {
      /* It means pre-allocated template does not have CKA_EC_POINT attribute - should never get here*/
      e_ret_status = CKR_GENERAL_ERROR;
    }
  }
  else
  {
    /* It means input template does not have CKA_EC_POINT attribute - should never get here*/
    e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
  }


  /* if error, return */
  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* ========== Assign the object to the session ========== */
  if (ObjectSetSession(h_obj, hSession) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Return the new object handle  ========== */

  /*Return the object handle*/
  *phObject = h_obj;

  return CKR_OK;
}

/**
  * @brief C_CopyObject copies an object, creating a new object for the copy.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pTemplate     template for the new object
  * @param  ulCount     attributes in template
  * @param  phNewObject     receives handle of copy.
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_CopyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ATTRIBUTE_PTR pTemplate,
                                   CK_ULONG ulCount, CK_OBJECT_HANDLE_PTR phNewObject)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DestroyObject destroys an object.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_DestroyObject(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GetObjectSize gets the size of an object in bytes.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pulSize     receives size of objec
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED
  */
static CK_RV STSAFE_P11_GetObjectSize(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hObject, CK_ULONG_PTR pulSize)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_GetAttributeValue obtains the value of one or more object attributes
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pTemplate    specifies attrs; gets vals
  * @param  ulCount     attributes in template
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED, CKR_OBJECT_HANDLE_INVALID, CKR_FUNCTION_FAILED, CKR_ATTRIBUTE_SENSITIVE,
  *               CKR_ATTRIBUTE_TYPE_INVALID, CKR_BUFFER_TOO_SMALL, CKR_OK.
  */
static CK_RV STSAFE_P11_GetAttributeValue(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE  hObject,
                                          CK_ATTRIBUTE_PTR  pTemplate, CK_ULONG  ulCount)
{
  uint32_t i;
  CK_RV e_ret_status;
  CK_ATTRIBUTE_PTR  p_template_embedded;
  CK_ATTRIBUTE_PTR  p_attribute;
  CK_ULONG  ul_count_embedded;
  CK_ULONG ul_value_len_tmp;

  /* Check input parameters */
  if ((pTemplate == NULL_PTR) || (ulCount == 0UL))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

