MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========================= Look for the specific object ============================== */

  /* Get a pointer to the template of the embbeded object corresponding to hObject handle specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
  {
    /*Handle specified is not a valid object*/
    return CKR_OBJECT_HANDLE_INVALID;
  }

  /* ========== Copy embedded object attributes to the template provided in input ========== */
  /*
    * For each (type, pValue, ulValueLen) triple in the template, C_GetAttributeValue performs the following algorithm:
    * 1. If the specified attribute (i.e., the attribute specified by the type field) for the object cannot be
    *    revealed because the object is sensitive or unextractable, then the ulValueLen field in that triple
    *    is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    * 2. Otherwise, if the specified value for the object is invalid (the object does not possess such an
    *    attribute), then the ulValueLen field in that triple is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    * 3. Otherwise, if the pValue field has the value NULL_PTR, then the ulValueLen field is modified to hold the
    *    exact length of the specified attribute for the object.
    * 4. Otherwise, if the length specified in ulValueLen is large enough to hold the value of the specified
    *    attribute for the object,then that attribute is copied into the buffer located at pValue, and the ulValueLen
    *    field is modified to hold the exact length of the attribute.
    * 5. Otherwise, the ulValueLen field is modified to hold the value CK_UNAVAILABLE_INFORMATION.
    */

  /*Init*/
  e_ret_status = CKR_OK;

  /*Loop on all the attributes of input Template*/
  for (i = 0; i < ulCount; i++)
  {
    /* Look for the attribute in the corresponding embedded object */
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute, pTemplate[i].type, p_template_embedded,
                                           ul_count_embedded) == CKR_OK)
    {
      /* Check if the attribute is sensitive */
      if (IsAttributeSensitive(pTemplate[i].type, p_template_embedded, ul_count_embedded) == CK_TRUE)
      {
        /* The attribute specified by the type field for the object cannot be revealed because the object is sensitive
         * or unextractable, then the ulValueLen field in that triple is modified to hold
         * the value CK_UNAVAILABLE_INFORMATION.*/
        pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;

        /* If case 1 applies to any of the requested attributes, then the call should return the value
         * CKR_ATTRIBUTE_SENSITIVE*/
        e_ret_status = CKR_ATTRIBUTE_SENSITIVE;
      }
      else
      {
        /* Get Value Len*/
        if (GetAttributeValueFromTemplate(NULL_PTR, &ul_value_len_tmp, pTemplate[i].type, p_template_embedded,
                                          ul_count_embedded) != CKR_OK)
        {
          /*Return immediately*/
          return CKR_FUNCTION_FAILED;
        }

        /* Check if inpute template provided a pValue pointer to store the content for that attribute */
        if (pTemplate[i].pValue == NULL_PTR)
        {
          /* If the pValue field has the value NULL_PTR, then the ulValueLen field is modified to hold the exact length
           * of the specified attribute for the object */
          pTemplate[i].ulValueLen = ul_value_len_tmp;
        }
        else
        {
          /* Otherwise, if the length specified in ulValueLen is large enough to hold the value of the specified
           * attribute for the object, then that attribute is
           * copied into the buffer located at pValue, and the ulValueLen field is modified to hold the exact
           * length of the attribute*/
          if (pTemplate[i].ulValueLen >= ul_value_len_tmp)
          {
            if (GetAttributeValueFromTemplate(pTemplate[i].pValue, &pTemplate[i].ulValueLen, pTemplate[i].type,
                                              p_template_embedded,
                                              ul_count_embedded) != CKR_OK)
            {
              /*Return immediately*/
              return CKR_FUNCTION_FAILED;
            }
          }
          else
          {
            /* Otherwise, the ulValueLen field is modified to hold the value CK_UNAVAILABLE_INFORMATION
             * return is CKR_BUFFER_TOO_SMALL */
            pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;
            e_ret_status = CKR_BUFFER_TOO_SMALL;
          }
        }
      }
    }
    else
    {
      /* The object does not possess such an attribute,then the ulValueLen field in that triple
       * is modified to hold the value CK_UNAVAILABLE_INFORMATION.*/
      pTemplate[i].ulValueLen = CK_UNAVAILABLE_INFORMATION;

      /* If case 2 applies to any of the requested attributes, then the call should return
       * the value CKR_ATTRIBUTE_TYPE_INVALID*/
      e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
    }
  }

  /* Only if none of the return errors applies to any of the requested attributes CKR_OK is returned.*/
  if ((e_ret_status != CKR_ATTRIBUTE_SENSITIVE) && (e_ret_status != CKR_ATTRIBUTE_TYPE_INVALID)
      && (e_ret_status != CKR_BUFFER_TOO_SMALL))
  {
    e_ret_status = CKR_OK;
  }

  /*As usual, if more than one of the error codes is applicable, Cryptoki may return any of them*/
  return e_ret_status;
}

/**
  * @brief  C_SetAttributeValue modifies the value of one or more object attributes.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  hObject     the object's handle
  * @param  pTemplate    specifies attrs and values
  * @param  ulCount     attributes in template
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SetAttributeValue(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE  hObject,
                                          CK_ATTRIBUTE_PTR  pTemplate, CK_ULONG          ulCount)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}



/**
  * @brief  C_FindObjectsInit initializes a search for token and session objects that match a template
  * @param  hSession     the session's handle
  * @param  pTemplate    attribute values to match
  * @param  ulCount     attrs in search template
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED, CKR_OPERATION_ACTIVE, CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_FindObjectsInit(CK_SESSION_HANDLE hSession, CK_ATTRIBUTE_PTR pTemplate,
                                        CK_ULONG ulCount)
{
  CK_RV e_ret_status;
  CK_OBJECT_HANDLE h_found_object[STSAFE_P11_NUMBER_OBJECTS];
  CK_ULONG ul_object_count;

