MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  /*Note: pTemplate = NULL_PTR is ok only if ulCount = 0*/
  if (((pTemplate == NULL_PTR) && (ulCount > 0U)) || (ulCount > STSAFE_P11_MAX_TEMPLATE_SIZE))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check active operation status ========== */

  /* Check if there is already an operation active */
  if (SessionOperationIsActive(hSession) == CKR_OK)
  {
    return CKR_OPERATION_ACTIVE;
  }

  /* ========== Look for the objects  ========== */
  /*Note: if ulCount was 0, phObject will be filled with a list of all objects handles up to STSAFE_P11_NUMBER_OBJECTS*/
  e_ret_status = FindObjectsFromTemplate(hSession, &h_found_object[0U], sizeof(h_found_object) /
                                         sizeof(h_found_object[0]), &ul_object_count, pTemplate, ulCount) ;

  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* ========== Store the objects found corresponding to input template ========== */
  if (SessionOperationSetObjects(hSession, &h_found_object[0U], ul_object_count) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }


  return CKR_OK;
}

/**
  * @brief  C_FindObjects continues a search for token and session objects that
  *          match a template, obtaining additional object handles
  * @param  hSession     session's handle
  * @param  phObject    gets obj. handles
  * @param  ulMaxObjectCount    max handles to get
  * @param  pulObjectCount    actual # returned
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
          CKR_SESSION_CLOSED, CKR_OPERATION_NOT_INITIALIZED, CKR_FUNCTION_FAILED,
          CKR_ATTRIBUTE_VALUE_INVALID, CKR_OK.
  */
static CK_RV STSAFE_P11_FindObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR phObject,
                                    CK_ULONG ulMaxObjectCount,  CK_ULONG_PTR pulObjectCount)
{

  /*Check input parameters*/
  if ((phObject == NULL_PTR) || (pulObjectCount == NULL_PTR) || (ulMaxObjectCount <= 0UL))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check active operation status ========== */

  /* Check if there is a pending operation: i.e. FindObjectInit was called*/
  if (SessionOperationIsActive(hSession) != CKR_OK)
  {
    return CKR_OPERATION_NOT_INITIALIZED;
  }

  /* ========== Get active operation objects ========== */
  if (SessionOperationGetObjects(hSession, phObject, ulMaxObjectCount, pulObjectCount) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }


  return CKR_OK;
}

/**
  * @brief  C_FindObjectsFinal finishes a search for token and session objects.
  * @param  hSession     session's handle
  * @retval CK_RV CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID, CKR_SESSION_CLOSED,
  *               CKR_OPERATION_NOT_INITIALIZED, CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_FindObjectsFinal(CK_SESSION_HANDLE hSession)
{

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check active operation status ========== */

  /* Check if there is FindObjectInit was called*/
  if (SessionOperationIsActive(hSession) != CKR_OK)
  {
    return CKR_OPERATION_NOT_INITIALIZED;
  }

  /* ========== Reset active operation  ========== */

  if (SessionOperationFinish(hSession) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  return CKR_OK;
}
/**
  * @brief  C_EncryptInit initializes an encryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pMechanism    the encryption mechanism
  * @param  hKey    handle of encryption key
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_EncryptInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_Encrypt encrypts single-part data.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pData    the plaintext data
  * @param  ulDataLen     bytes of plaintext
  * @param  pEncryptedData    gets ciphertext
  * @param  pulEncryptedDataLen   gets c-text size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_Encrypt(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen,
                                CK_BYTE_PTR pEncryptedData, CK_ULONG_PTR pulEncryptedDataLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_EncryptUpdate continues a multiple-part encryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pPart    the plaintext data
  * @param  ulPartLen     bytes of plaintext
  * @param  pEncryptedPart    gets ciphertext
  * @param  pulEncryptedPartLen   gets c-text size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_EncryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen,
                                      CK_BYTE_PTR pEncryptedPart, CK_ULONG_PTR pulEncryptedPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_EncryptFinal finishes a multiple-part encryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pLastEncryptedPart    last c-text
  * @param  pulLastEncryptedPartLen   gets last size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_EncryptFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pLastEncryptedPart,
                                     CK_ULONG_PTR pulLastEncryptedPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DecryptInit initializes a decryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pMechanism    the decryption mechanism
  * @param  hKey    handle of decryption key
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DecryptInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_Decrypt decrypts encrypted data in a single part.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pEncryptedData    ciphertext
  * @param  ulEncryptedDataLen     ciphertext lenght
  * @param  pData    gets plaintext
  * @param  pulDataLen   gets p-text size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_Decrypt(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedData, CK_ULONG ulEncryptedDataLen,
                                CK_BYTE_PTR pData, CK_ULONG_PTR pulDataLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DecryptUpdate continues a multiple-part decryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pEncryptedData    encrypted data
  * @param  ulEncryptedPartLen     input length
  * @param  pPart    gets plaintext
  * @param  pulPartLen   p-text size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DecryptUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pEncryptedPart,
                                      CK_ULONG ulEncryptedPartLen, CK_BYTE_PTR pPart, CK_ULONG_PTR pulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DecryptFinal finishes a multiple-part decryption operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pLastPart   gets plaintext
  * @param  pulLastPartLen     p-text size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DecryptFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pLastPart, CK_ULONG_PTR pulLastPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DigestInit initializes a message-digesting operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pMechanism    the digesting mechanism
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DigestInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_Digest digests data in a single part.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession     the session's handle
  * @param  pData     data to be digested
  * @param  ulDataLen     bytes of data to digest
  * @param  pDigest     gets the message digest
  * @param  pulDigestLen     gets digest length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_Digest(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen, CK_BYTE_PTR pDigest,
                               CK_ULONG_PTR pulDigestLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DigestUpdate continues a multiple-part message-digesting operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession  hSession,   the session's handle
  * @param  pData     pPart,      data to be digested
  * @param  ulDataLen ulPartLen   bytes of data to be digested
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DigestUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DigestKey continues a multi-part message-digesting
  *         operation, by digesting the value of a secret key as part of
  *         the data already digested.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession  hSession,   the session's handle
  * @param  pData     hKey        secret key to digest
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DigestKey(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE hKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_DigestFinal finishes a multiple-part message-digesting operation.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession,     the session's handle
  * @param  pDigest,      gets the message digest
  * @param  pulDigestLen  gets byte count of digest
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_DigestFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pDigest, CK_ULONG_PTR pulDigestLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_SignInit initializes a signature (private key encryption)
  *         operation, where the signature is (will be) an appendix to
  *         the data, and plaintext cannot be recovered from the
  *         signature.
  * @note   In this implementation only operations on objects with the following attributes are allowed:
  *          - CKA_CLASS = CKO_PRIVATE_KEY
  *          - CKA_KEY_TYPE = CKK_EC
  *          - CKA_SIGN = CK_TRUE
  * @param  hSession,    the session's handle
  * @param  pMechanism,  the signature mechanism
  * @param  hKey         handle of signature key
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,
  *               CKR_SESSION_CLOSED, CKR_OPERATION_ACTIVE, CKR_KEY_HANDLE_INVALID, CKR_MECHANISM_INVALID,
  *               CKR_KEY_TYPE_INCONSISTENT,CKR_KEY_FUNCTION_NOT_PERMITTED, CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_SignInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR  pMechanism,
                                 CK_OBJECT_HANDLE  hObject)
{
  CK_ATTRIBUTE_PTR p_attribute_tmp;
  CK_ATTRIBUTE_PTR  p_template_embedded;
  CK_ULONG  ul_count_embedded;

