MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if ((pData == NULL_PTR) || (ulDataLen == 0UL) || (pulSignatureLen == NULL_PTR))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* Check if there is already an operation active */
  if (SessionOperationIsActive(hSession) != CKR_OK)
  {
    return CKR_OPERATION_NOT_INITIALIZED;
  }

  /* ========== Get active operation object ========== */
  if (SessionOperationGetObjects(hSession, &h_object, 1, &ul_count) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* Get a pointer to the object using hobject specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template, &ul_count, h_object) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Check CKA_EC_PARAMS attribute ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_PARAMS, p_template, ul_count) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /*Extract curve and data len from key OID */
  if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_256_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-256*/
    e_hash_type = STSAFEA_SHA_256;
    ul_data_len =  STSAFEA_SHA_256_LENGTH;
    ul_sign_out_len = (STSAFEA_SHA_256_LENGTH * 2);
    u_sign_in_len = STSAFEA_LENGTH_CMD_RESP_GENERATE_SIGNATURE_SHA_256;

  }
  else if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_384_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-384*/
    e_hash_type = STSAFEA_SHA_384;
    ul_data_len =  STSAFEA_SHA_384_LENGTH;
    ul_sign_out_len = (STSAFEA_SHA_384_LENGTH * 2);
    u_sign_in_len = STSAFEA_LENGTH_CMD_RESP_GENERATE_SIGNATURE_SHA_384;
  }
  else
  {
    /* It should never get here*/
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Check input data len ========== */
  if (ulDataLen != ul_data_len)
  {
    SessionOperationFinish(hSession);
    return CKR_DATA_LEN_RANGE;
  }

  /* ========== Check signature buffer========== */
  if (pSignature != NULL_PTR)
  {
    /* ========== Check CKA_EXT_TOKEN_PRVKEY_SLOT attribute========== */
    /* This vendor defined attribute links one PKCS11 object to a specific feature of STSAFE*/

    /* Extract from the template the external token slot*/
    if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXT_TOKEN_PRVKEY_SLOT, p_template, ul_count) != CKR_OK)
    {
      return CKR_FUNCTION_FAILED;
    }

    /* ========== Sign with STSAFE  ========== */

    /* Generate Signature */
    if (StSafeA_GenerateSignature(&hStSafe, __STSAFEA_GET_SLOT_ID_FROM_CK(p_attribute_tmp->pValue), pData, e_hash_type,
                                  u_sign_in_len,  &signature, STSAFEA_MAC_NONE, STSAFEA_ENCRYPTION_NONE) != STSAFEA_OK)
    {
      /*Reset Signature Session */
      SessionOperationFinish(hSession);
      return CKR_FUNCTION_FAILED;
    }

    /* ========== Prepare output data  ========== */

    /* STSAFE output is formatted as per the following: ( R_LENGHT (2 bytes) | R | S_LENGHT(2bytes) | S) */

    /* Extract Signature R length */
    ul_r_length = ((uint32_t)(signature.Data[0U]) << 8UL);
    ul_r_length += signature.Data[1U];

    /* Extract Signature S length */
    ul_s_length = ((uint32_t)(signature.Data[2UL + ul_r_length]) << 8UL);
    ul_s_length += signature.Data[3UL + ul_r_length];

    /* ========== Check Buffer size  ========== */
    /* Note: parameter pulSignatureLen is used in input/output mode - the one specified in input must specify a size
     * big enough to store the output*/
    if (*pulSignatureLen < (ul_r_length + ul_s_length))
    {
      /* If the buffer is not large enough, then CKR_BUFFER_TOO_SMALL is returned.*/
      *pulSignatureLen = ul_r_length + ul_s_length;

      /*Return and not close active operation*/
      return CKR_BUFFER_TOO_SMALL;
    }

    /* ========== Copy the signature in output  ========== */

    /* Copy Signature R */
    (void)memcpy(&pSignature[0U], &signature.Data[2U], ul_r_length);

    /* Copy Signature S */
    (void)memcpy(&pSignature[ul_r_length], &signature.Data[2UL + ul_r_length + 2UL], ul_s_length);

    /* Copy signature len */
    *pulSignatureLen = ul_r_length + ul_s_length;

    /* ========== Close Signature operation  ========== */
    /* Close Operation Session */
    SessionOperationFinish(hSession);

  }
  else
  {
    /* If pSignature is NULL_PTR, then all that the function does is return (in *pulBufLen) a number of bytes
    which would suffice to hold the cryptographic output produced from the input to the function */
    *pulSignatureLen = ul_sign_out_len;
  }

  return CKR_OK;
}


/**
  * @brief  C_SignUpdate continues a multiple-part signature operation,
  *         where the signature is (will be) an appendix to the data,
  *         and plaintext cannot be recovered from the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession, the session's handle
  * @param pPart,    the data to sign
  * @param ulPartLen count of bytes to sign
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SignUpdate(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pPart, CK_ULONG ulPartLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_SignFinal finishes a multiple-part signature operation,
  *         returning the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,        the session's handle
  * @param pSignature,      gets the signature
  * @param pulSignatureLen  gets signature length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SignFinal(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSignature, CK_ULONG_PTR pulSignatureLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_SignRecoverInit initializes a signature operation, where
  * the data can be recovered from the signature.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,   the session's handle
  * @param pMechanism, the signature mechanism
  * @param hKey        handle of the signature key
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SignRecoverInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_SignRecover signs data in a single operation, where the
  * data can be recovered from the signature.
  * @param hSession,        the session's handle
  * @param pData,           the data to sign
  * @param ulDataLen,       count of bytes to sign
  * @param pSignature,      gets the signature
  * @param pulSignatureLen  gets signature length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SignRecover(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pData, CK_ULONG ulDataLen,
                                    CK_BYTE_PTR pSignature, CK_ULONG_PTR pulSignatureLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_VerifyInit initializes a verification operation, where the
  *         signature is an appendix to the data, and plaintext cannot
  *         cannot be recovered from the signature (e.g. DSA).
  * @note   In this implementation only operations on objects with the following attributes are allowed:
  *          - CKA_CLASS = CKO_PUBLIC_KEY
  *          - CKA_KEY_TYPE = CKK_EC
  *          - CKA_VERIFY = CK_TRUE
  * @param hSession    the session's handle
  * @param pMechanism  the verification mechanism
  * @param hKey        verification key
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *               CKR_OPERATION_ACTIVE, CKR_KEY_HANDLE_INVALID, CKR_KEY_TYPE_INCONSISTENT, CKR_MECHANISM_INVALID,
  *               CKR_KEY_FUNCTION_NOT_PERMITTED, CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_VerifyInit(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR  pMechanism,
                                   CK_OBJECT_HANDLE  hObject)

{

  CK_ATTRIBUTE_PTR p_attribute_tmp;
  CK_ATTRIBUTE_PTR  p_template_embedded;
  CK_ULONG  ul_count_embedded;

