MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if (pMechanism == NULL_PTR)
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check active operation status ========== */

  /* Check that session not already used for another processing */
  if (SessionOperationIsActive(hSession) == CKR_OK)
  {
    return CKR_OPERATION_ACTIVE;
  }

  /* ========== Get the template of the object handle specified in input ========== */

  /* Get a pointer to the object template using hobject specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template_embedded, &ul_count_embedded, hObject) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /* ========== Check CKA_ALLOWED_MECHANISMS attribute  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_ALLOWED_MECHANISMS, p_template_embedded,
                                         ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if the mechanism type specified in input is allowed, if not return CKR_MECHANISM_INVALID*/
  if (IsMechanismTypeAllowed(pMechanism->mechanism, p_attribute_tmp->pValue, p_attribute_tmp->ulValueLen) != CK_TRUE)
  {
    return CKR_MECHANISM_INVALID;
  }

  /* ========== Check CKA_CLASS attribute  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_CLASS, p_template_embedded, ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_CLASS == CKO_PUBLIC_KEY, if not return CKR_KEY_TYPE_INCONSISTENT*/
  if (*((CK_OBJECT_CLASS *)(p_attribute_tmp->pValue)) != CKO_PUBLIC_KEY)
  {
    return CKR_KEY_TYPE_INCONSISTENT;
  }

  /* ========== Check CKA_KEY_TYPE attribute  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_KEY_TYPE, p_template_embedded,
                                         ul_count_embedded) != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_KEY_TYPE == CKK_EC, if not return CKR_KEY_TYPE_INCONSISTENT*/
  if (*((CK_KEY_TYPE *)(p_attribute_tmp->pValue)) != CKK_EC)
  {
    return CKR_KEY_TYPE_INCONSISTENT;
  }

  /* ========== Check CKA_VERIFY attribute  ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_VERIFY, p_template_embedded, ul_count_embedded)
      != CKR_OK)
  {
    return CKR_KEY_HANDLE_INVALID;
  }

  /*Check if CKA_VERIFY == CK_TRUE, if not return CKR_KEY_FUNCTION_NOT_PERMITTED*/
  if (*((CK_BBOOL *)(p_attribute_tmp->pValue)) != CK_TRUE)
  {
    return CKR_KEY_FUNCTION_NOT_PERMITTED;
  }

  /* ========== Store the object selected for the operation ========== */
  if (SessionOperationSetObjects(hSession, &hObject, 1) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  return CKR_OK;
}


/**
  * @brief  C_Verify verifies a signature in a single-part operation,
  *         where the signature is an appendix to the data, and plaintext
  *         cannot be recovered from the signature.
  * @param hSession        the session's handle
  * @param pData           signed data
  * @param ulDataLen       length of signed data
  * @param pSignature      signature
  * @param ulSignatureLen  signature length
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *         CKR_OPERATION_NOT_INITIALIZED, CKR_SIGNATURE_LEN_RANGE, CKR_FUNCTION_FAILED, CKR_DATA_INVALID,
  *         CKR_DATA_LEN_RANGE, CKR_SIGNATURE_INVALID, CKR_OK.
  */
static CK_RV STSAFE_P11_Verify(CK_SESSION_HANDLE     hSession,  CK_BYTE_PTR   pData,
                               CK_ULONG ulDataLen, CK_BYTE_PTR  pSignature,
                               CK_ULONG ulSignatureLen)
{

  CK_OBJECT_HANDLE  h_object;
  CK_ATTRIBUTE_PTR p_attribute_tmp, p_template;
  CK_ULONG  ul_count, ul_object_count, ul_public_data_raw_len;;
  CK_BYTE  p_public_data_raw[2UL * STSAFEA_SHA_384_LENGTH];        /* Using 384 max len. */

  /*Allocate variables to communicate with STSAFE*/
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, hash,
                                        STSAFEA_GET_HASH_SIZE((uint16_t)STSAFEA_SHA_384));  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, sig_r,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, sig_s,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_x,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_y,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */

  StSafeA_VerifySignatureBuffer_t verif;
  StSafeA_CurveId_t curve;
  uint32_t ul_data_len;

  /*Check input parameters*/
  if ((pData == NULL_PTR) || (pSignature == NULL_PTR))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* Check if there is VerifyInit was called*/
  if (SessionOperationIsActive(hSession) != CKR_OK)
  {
    return CKR_OPERATION_NOT_INITIALIZED;
  }

  /* ========== Get active operation object ========== */
  if (SessionOperationGetObjects(hSession, &h_object, 1, &ul_object_count) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* Get a pointer to the object using hobject specified in input */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_template, &ul_count, h_object) != CKR_OK)
  {
    SessionOperationFinish(hSession);
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Check CKA_EC_PARAMS attribute ========== */

