MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if ((pMechanism == NULL_PTR) || (pPublicKeyTemplate == NULL_PTR) || (pPrivateKeyTemplate == NULL_PTR)
      || (phPublicKey == NULL_PTR) || (phPrivateKey == NULL_PTR) || (ulPublicKeyAttributeCount == 0UL)
      || (ulPrivateKeyAttributeCount == 0UL))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Check mechanism ========== */
  if (pMechanism->mechanism != CKM_EC_KEY_PAIR_GEN)
  {
    return CKR_MECHANISM_INVALID;
  }

  /* ========== Private Key  ========== */
  /* Note: In this implementation we only support key generation on a specific object.
           Each call to GenerateKeyPair will overwrite this object.
           CKA_LABEL is used to refer uniquely to a specific pre-allocated object*/

  template_tmp.type = CKA_LABEL;
  template_tmp.pValue = P11_OBJ_LABEL_EPH_PRV_KEY;

  /*Look for the object corresponding to P11_OBJ_LABEL_EPH_PRV_KEY, 1 single object*/
  if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_prv_obj, 1, &ul_obj_cnt, &template_tmp, 1) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Get a pointer to the object template*/
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_prv_template_embedded, &ul_prv_count_embedded, h_prv_obj) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Public Key  ========== */
  /* Note: In this implementation we only support key generation on a specific object.
           Each call to GenerateKeyPair will overwrite this object.
           CKA_LABEL is used to refer uniquely to a specific pre-allocated object*/

  template_tmp.type = CKA_LABEL;
  template_tmp.pValue = P11_OBJ_LABEL_EPH_PUB_KEY;

  /*Look for the object corresponding to P11_OBJ_LABEL_EPH_PUB_KEY, 1 single object*/
  if (FindObjectsFromTemplate(CKV_SESSION_HANDLE_ANY, &h_pub_obj, 1, &ul_obj_cnt, &template_tmp, 1) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Get a pointer to the object template */
  if (STSAFE_OBJ_GetTemplateFromObjectHandle(&p_pub_template_embedded, &ul_pub_count_embedded, h_pub_obj) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Check selected Private object against pre-allocated template  ========== */

  /* Note: Since this implementation doesn't support dynamic memory allocation, the template specified in input will
    *       have to match pre-allocated objects. The only value that can be different is CKA_EC_POINT, the actual value
    *       of the public key, that is unique per key.
    *       Filter attributes so that they will not be considered when looking and comparing the template with
    *       pre-allocated objects.
    *       Private Key should not have CKA_EC_POINT attributes because the request is to generate a new key pair.
    */
  CK_ATTRIBUTE attribute_filter[] =  { {CKA_EC_POINT, NULL_PTR, 0}  } ;

  /*Filter template*/
  if (STSAFE_OBJ_FilterTemplate(p_template_filtered, &ul_count_filtered, pPrivateKeyTemplate,
                                ulPrivateKeyAttributeCount,
                                attribute_filter, sizeof(attribute_filter) / sizeof(attribute_filter[0])) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
  e_ret_status = STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_prv_template_embedded,
                                             ul_prv_count_embedded);

  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* ========== Check selected Public object against pre-allocated template  ========== */

  /*Filter template*/
  if (STSAFE_OBJ_FilterTemplate(p_template_filtered, &ul_count_filtered, pPublicKeyTemplate, ulPublicKeyAttributeCount,
                                attribute_filter, sizeof(attribute_filter) / sizeof(attribute_filter[0])) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Compare embedded referefence object with input template filtered of 'unique' values (e.g. CKA_EC_POINT).*/
  e_ret_status = STSAFE_OBJ_CompareTemplates(p_template_filtered, ul_count_filtered, p_pub_template_embedded,
                                             ul_pub_count_embedded);

  if (e_ret_status != CKR_OK)
  {
    return e_ret_status;
  }

  /* Note: at this stage both objects are compatible with pre-allocated templates,
     actual key generation process can start*/

  /* ========== Select the right curve using CKA_EC_PARAMS ========== */

  /* Extract from the private key pre-allocated template the CKA_EC_PARAMS attribute*/
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_PARAMS, p_prv_template_embedded,
                                         ul_prv_count_embedded) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* Extract curve and data len from key OID */
  /* Depending on this parameter, a different keypair can be generated - actual type available depends on the
   * configuration profile*/
  if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_256_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-256*/
    curve = STSAFEA_NIST_P_256;
  }
  else if (memcmp(p_attribute_tmp->pValue, STSAFEA_ECC_CURVE_OID_NIST_P_384_DER, p_attribute_tmp->ulValueLen) == 0)
  {
    /* NIST P-384*/
    curve = STSAFEA_NIST_P_384;
  }
  else
  {
    /* Should never get here */
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Extract CKA_EXT_TOKEN_PRVKEY_SLOT  ========== */
  /* This vendor defined attribute links one PKCS11 object to a specific feature of STSAFE*/

  /* Extract from the template the external token slot*/
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXT_TOKEN_PRVKEY_SLOT, p_prv_template_embedded,
                                         ul_prv_count_embedded) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Generate Key Pair with STSAFE  ========== */
  /* Note: In this implementation a unlimited usage, with only KEY Establishment mode of operation is enabled.
    *       Public Key will be returned to the application, while Private Key is stored securely and never
    *       leaves STSAFE. Curve type depends on CKA_EC_PARAM attributes specified in the configuration */

