MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  if (StSafeA_GenerateKeyPair(&hStSafe, __STSAFEA_GET_SLOT_ID_FROM_CK(p_attribute_tmp->pValue), 0xFFFFU, 1U,
                              (STSAFEA_PRVKEY_MODOPER_AUTHFLAG_KEY_ESTABLISHEN),
                              curve, &point_reprensentation_id,
                              STSAFEA_GET_XYRS_LEN_FROM_CURVE(curve),
                              &pub_x, &pub_y, STSAFEA_MAC_HOST_CMAC) != STSAFEA_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Prepare output data  ========== */

  /* Comput data len  */
  ul_public_data_raw_len = (uint32_t)pub_x.Length;
  ul_public_data_raw_len += (uint32_t) pub_y.Length;

  /* Copy Public Key X coordinate */
  (void)memcpy(&p_public_data_raw[0U], pub_x.Data, pub_x.Length);

  /* Copy Public Key Y coordinate */
  (void)memcpy(&p_public_data_raw[pub_x.Length], pub_y.Data, pub_y.Length);

  /* ========== Update CKA_EC_POINT attribute of the pre-allocated object ========== */

  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EC_POINT, p_pub_template_embedded,
                                         ul_pub_count_embedded) != CKR_OK)
  {
    return CKR_ATTRIBUTE_TYPE_INVALID;
  }

  /* ========== Check if pre-allocated space is enough to store the new public key  ========== */

  if (ul_public_data_raw_len > p_attribute_tmp->ulValueLen)
  {
    return CKR_DEVICE_MEMORY;
  }

  /* ========== Encode and update CKA_EC_POINT  ========== */

  /*Encode raw data into DER x962 EC Point format expected by PKCS11 spec*/
  /*Note: len value is local only - can't overwrite the ulValueLen constant value in flash for this object*/
  if (EncodeRawToDerASN1UncompressedEcPoint(p_attribute_tmp->pValue, &u_len_tmp, p_public_data_raw,
                                            ul_public_data_raw_len) != CKR_OK)
  {
    return CKR_ATTRIBUTE_VALUE_INVALID;
  }

  /* ========== Assign the object to the session ========== */

  if (ObjectSetSession(h_pub_obj, hSession) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Return object handles ========== */

  /*return object handles*/
  *phPublicKey = h_pub_obj;
  *phPrivateKey = h_prv_obj;

  return CKR_OK;
}

/**
  * @brief  C_WrapKey wraps (i.e., encrypts) a key.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,        the session's handle
  * @param pMechanism,      the wrapping mechanism
  * @param hWrappingKey,    wrapping key
  * @param hKey,            key to be wrapped
  * @param pWrappedKey,     gets wrapped key
  * @param pulWrappedKeyLen gets wrapped key size
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_WrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism, CK_OBJECT_HANDLE hWrappingKey,
                                CK_OBJECT_HANDLE hKey, CK_BYTE_PTR pWrappedKey, CK_ULONG_PTR pulWrappedKeyLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief   C_UnwrapKey unwraps (decrypts) a wrapped key, creating a new key object.
  * @param    hSession          session's handle
  * @param    pMechanism        unwrapping mech.
  * @param    hUnwrappingKey    unwrapping key
  * @param    pWrappedKey       the wrapped key
  * @param    ulWrappedKeyLen   wrapped key len
  * @param    pTemplate         new key template
  * @param    ulAttributeCount  template length
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_UnwrapKey(CK_SESSION_HANDLE hSession, CK_MECHANISM_PTR pMechanism,
                                  CK_OBJECT_HANDLE hUnwrappingKey, CK_BYTE_PTR pWrappedKey, CK_ULONG ulWrappedKeyLen,
                                  CK_ATTRIBUTE_PTR pTemplate,
                                  CK_ULONG ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}


/**
  * @brief  C_DeriveKey derives a key from a base key, creating a new key object.
  * @note   This implementation only supports ECDH1 with CKD_NULL parameter derivation.
  *         The key derivation function CKD_NULL produces a raw shared secret value.
  *         Diffie-Hellman derivation will be computed using the ephemeral private key stored in
  *         STSAFE and generated with C_GenerateKeyPair in combination with a public key provided
  *         in input through pMechanism.
  * @param  hSession          session's handle
  * @param  pMechanism        key deriv. mech.
  * @param  hBaseKey          base key
  * @param  pTemplate         new key template
  * @param  ulAttributeCount  template length
  * @param  phKey             gets derived key object
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *               CKR_MECHANISM_INVALID, CKR_MECHANISM_PARAM_INVALID, CKR_DOMAIN_PARAMS_INVALID,
  *               CKR_ATTRIBUTE_VALUE_INVALID,CKR_ATTRIBUTE_TYPE_INVALID, CKR_TEMPLATE_INCONSISTENT,
  *               CKR_ATTRIBUTE_READ_ONLY, CKR_FUNCTION_FAILED, CKR_DEVICE_MEMORY, CKR_OK.
  */
static CK_RV STSAFE_P11_DeriveKey(CK_SESSION_HANDLE  hSession, CK_MECHANISM_PTR  pMechanism,
                                  CK_OBJECT_HANDLE   hBaseKey, CK_ATTRIBUTE_PTR     pTemplate,
                                  CK_ULONG   ulAttributeCount, CK_OBJECT_HANDLE_PTR phKey)
{
  CK_RV e_ret_status;
  CK_ECDH1_DERIVE_PARAMS_PTR p_params;
  CK_OBJECT_HANDLE h_obj_shrd_secret_x;
  CK_ATTRIBUTE  template_tmp, p_template_filtered[STSAFE_P11_MAX_TEMPLATE_SIZE];
  CK_ATTRIBUTE_PTR p_attribute_tmp, p_template_base, p_template_secret;
  CK_ULONG  ul_count_base, ul_count_secret, ul_public_data_raw_len, prv_key_len, ul_obj_cnt, ul_count_filtered;
  CK_BYTE  p_public_data_raw[2UL * STSAFEA_SHA_384_LENGTH];

  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_x,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */
  STSAFEA_STATIC_ALLOCATE_LV_BUFFER_VAR(StSafeA_LVBuffer_t, pub_y,
                                        STSAFEA_XYRS_ECDSA_SHA384_LENGTH);  /* Using 384 max len. */

  StSafeA_SharedSecretBuffer_t shared_secret;
  uint8_t SharedKey_Data[STSAFEA_XYRS_ECDSA_SHA384_LENGTH];
  shared_secret.SharedKey.Data   = SharedKey_Data;

