MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /* Check if pre-allocated space is enough to store the new public key */
  if (shared_secret.SharedKey.Length > p_attribute_tmp->ulValueLen)
  {
    return CKR_DEVICE_MEMORY;
  }

  /* Copy STSAFE generated SharedKey coordinate to local variable */
  if (STSAFE_OBJ_SetAttributeValue(p_attribute_tmp, (CK_BYTE_PTR)shared_secret.SharedKey.Data,
                                   shared_secret.SharedKey.Length) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Assign the object to the session ========== */
  if (ObjectSetSession(h_obj_shrd_secret_x, hSession) != CKR_OK)
  {
    return CKR_FUNCTION_FAILED;
  }

  /* ========== Return object value ========== */

  /* Return object id */
  *phKey = h_obj_shrd_secret_x;

  return CKR_OK;
}

/**
  * @brief  C_SeedRandom mixes additional seed material into the token's
  * random number generator
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession,  the session's handle
  * @param pSeed,     the seed material
  * @param ulSeedLen  length of seed material
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_SeedRandom(CK_SESSION_HANDLE hSession, CK_BYTE_PTR pSeed, CK_ULONG ulSeedLen)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}

/**
  * @brief  C_GenerateRandom generates random data.
  * @note   In this implementation, STSAFE_RANDOM_MAX_LEN max size is allowed.
  * @param hSession    the session's handle
  * @param RandomData  receives the random data
  * @param ulRandomLen  # of bytes to generate
  * @retval CK_RV CKR_ARGUMENTS_BAD,CKR_CRYPTOKI_NOT_INITIALIZED, CKR_SESSION_HANDLE_INVALID,CKR_SESSION_CLOSED,
  *         CKR_FUNCTION_FAILED, CKR_OK.
  */
static CK_RV STSAFE_P11_GenerateRandom(CK_SESSION_HANDLE hSession, CK_BYTE_PTR  pRandomData,
                                       CK_ULONG          ulRandomLen)
{
  CK_RV e_ret_status;

  StSafeA_LVBuffer_t out_generate_random;

  /*Check input parameters*/
  if ((pRandomData == NULL_PTR) || (ulRandomLen == 0UL) || (ulRandomLen > STSAFE_RANDOM_MAX_LEN))
  {
    return CKR_ARGUMENTS_BAD;
  }

  /* ========== Check PKCS11 status and session  ========== */

  /* Check if PKCS11 module has already been initialized */
  if (uInitialized == CK_FALSE)
  {
    return CKR_CRYPTOKI_NOT_INITIALIZED;
  }

  /* Check if the Session handle specified in input is valid */
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /* Check if Session is open */
  if (SessionIsOpen(hSession) != CKR_OK)
  {
    return CKR_SESSION_CLOSED;
  }

  /* ========== Generate Random Number with STSAFE ========== */
  if ((StSafeA_GenerateRandom(&hStSafe, STSAFEA_EPHEMERAL, (uint8_t)ulRandomLen, &out_generate_random,
                              STSAFEA_MAC_NONE) != STSAFEA_OK) || (out_generate_random.Length != ulRandomLen))
  {
    e_ret_status = CKR_FUNCTION_FAILED;
  }
  else
  {
    (void)memcpy(pRandomData, out_generate_random.Data, out_generate_random.Length);
    e_ret_status = CKR_OK;
  }

  return e_ret_status;
}

/**
  * @brief  C_GetFunctionStatus is a legacy function; it obtains an
  *         updated status of a function running in parallel with an application.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  hSession  the session's handle
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_GetFunctionStatus(CK_SESSION_HANDLE hSession)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief C_CancelFunction is a legacy function; it cancels a function
  *        running in parallel
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param hSession  the session's handle
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_CancelFunction(CK_SESSION_HANDLE hSession)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}
/**
  * @brief  C_WaitForSlotEvent waits for a slot event (token insertion, removal, etc.) to occur.
  * @note   NOT SUPPORTED IN THIS IMPLEMENTATION.
  * @param  flags,        blocking/nonblocking flag
  * @param  pSlot,  location that receives the slot ID
  * @param  pRserved   reserved.  Should be NULL_PTR
  * @retval CK_RV CKR_FUNCTION_NOT_SUPPORTED.
  */
static CK_RV STSAFE_P11_WaitForSlotEvent(CK_FLAGS flags, CK_SLOT_ID_PTR pSlot, CK_VOID_PTR pRserved)
{
  return CKR_FUNCTION_NOT_SUPPORTED;
}


/**
  * @brief KMS GetFunctionList function.
  *   This function return the function list supported by the api.
  * @param ppFunctionList point to structure listing the functions.
  * @retval CK_RV CKR_OK if successful, see PKCS11 return values for more information.
  */
CK_RV KMS_EXT_TOKEN_GetFunctionList(CK_FUNCTION_LIST_PTR_PTR ppFunctionList)
{
  CK_RV ck_rv_ret_status = CKR_OK;
  CK_FUNCTION_LIST_PTR pFunctionList = *ppFunctionList;

  pFunctionList->version.major = 2;
  pFunctionList->version.minor = 40;

  pFunctionList->C_Initialize = STSAFE_P11_Initialize;
  pFunctionList->C_Finalize = STSAFE_P11_Finalize;
  pFunctionList->C_GetInfo  = STSAFE_P11_GetInfo;
  pFunctionList->C_GetFunctionList = KMS_EXT_TOKEN_GetFunctionList;
  pFunctionList->C_GetSlotList = STSAFE_P11_GetSlotList;
  pFunctionList->C_GetSlotInfo = STSAFE_P11_GetSlotInfo;
  pFunctionList->C_GetTokenInfo = STSAFE_P11_GetTokenInfo;
  pFunctionList->C_GetMechanismList  = STSAFE_P11_GetMechanismList  ;
  pFunctionList->C_GetMechanismInfo  = STSAFE_P11_GetMechanismInfo;
  pFunctionList->C_InitToken  = STSAFE_P11_InitToken;
  pFunctionList->C_InitPIN  = STSAFE_P11_InitPIN;
  pFunctionList->C_SetPIN  = STSAFE_P11_SetPIN;
  pFunctionList->C_OpenSession = STSAFE_P11_OpenSession;
  pFunctionList->C_CloseSession = STSAFE_P11_CloseSession;
  pFunctionList->C_CloseAllSessions  = STSAFE_P11_CloseAllSessions;
  pFunctionList->C_GetSessionInfo  = STSAFE_P11_GetSessionInfo;
  pFunctionList->C_GetOperationState  = STSAFE_P11_GetOperationState;
  pFunctionList->C_SetOperationState  = STSAFE_P11_SetOperationState;
  pFunctionList->C_Login  = STSAFE_P11_Login;
  pFunctionList->C_Logout  = STSAFE_P11_Logout;
  pFunctionList->C_CreateObject = STSAFE_P11_CreateObject;
  pFunctionList->C_CopyObject  = STSAFE_P11_CopyObject;
  pFunctionList->C_DestroyObject  = STSAFE_P11_DestroyObject;
  pFunctionList->C_GetObjectSize  = STSAFE_P11_GetObjectSize;
  pFunctionList->C_GetAttributeValue = STSAFE_P11_GetAttributeValue;
  pFunctionList->C_SetAttributeValue = STSAFE_P11_SetAttributeValue;
  pFunctionList->C_FindObjectsInit = STSAFE_P11_FindObjectsInit;
  pFunctionList->C_FindObjects = STSAFE_P11_FindObjects;
  pFunctionList->C_FindObjectsFinal = STSAFE_P11_FindObjectsFinal;
  pFunctionList->C_EncryptInit  = STSAFE_P11_EncryptInit;
  pFunctionList->C_Encrypt  = STSAFE_P11_Encrypt;
  pFunctionList->C_EncryptUpdate  = STSAFE_P11_EncryptUpdate;
  pFunctionList->C_EncryptFinal  = STSAFE_P11_EncryptFinal;
  pFunctionList->C_DecryptInit  = STSAFE_P11_DecryptInit;
  pFunctionList->C_Decrypt  = STSAFE_P11_Decrypt;
  pFunctionList->C_DecryptUpdate  = STSAFE_P11_DecryptUpdate;
  pFunctionList->C_DecryptFinal  = STSAFE_P11_DecryptFinal;
  pFunctionList->C_DigestInit  = STSAFE_P11_DigestInit;
  pFunctionList->C_Digest  = STSAFE_P11_Digest;
  pFunctionList->C_DigestUpdate  = STSAFE_P11_DigestUpdate;
  pFunctionList->C_DigestKey  = STSAFE_P11_DigestKey;
  pFunctionList->C_DigestFinal  = STSAFE_P11_DigestFinal;
  pFunctionList->C_SignInit = STSAFE_P11_SignInit;
  pFunctionList->C_Sign = STSAFE_P11_Sign;
  pFunctionList->C_SignUpdate  = STSAFE_P11_SignUpdate;
  pFunctionList->C_SignFinal  = STSAFE_P11_SignFinal;
  pFunctionList->C_SignRecoverInit  = STSAFE_P11_SignRecoverInit;
  pFunctionList->C_SignRecover  = STSAFE_P11_SignRecover;
  pFunctionList->C_VerifyInit = STSAFE_P11_VerifyInit;
  pFunctionList->C_Verify = STSAFE_P11_Verify;
  pFunctionList->C_VerifyUpdate  = STSAFE_P11_VerifyUpdate;
  pFunctionList->C_VerifyFinal  = STSAFE_P11_VerifyFinal;
  pFunctionList->C_VerifyRecoverInit  = STSAFE_P11_VerifyRecoverInit;
  pFunctionList->C_VerifyRecover  = STSAFE_P11_VerifyRecover;
  pFunctionList->C_DigestEncryptUpdate  = STSAFE_P11_DigestEncryptUpdate;
  pFunctionList->C_DecryptDigestUpdate  = STSAFE_P11_DecryptDigestUpdate;
  pFunctionList->C_SignEncryptUpdate  = STSAFE_P11_SignEncryptUpdate;
  pFunctionList->C_DecryptVerifyUpdate  = STSAFE_P11_DecryptVerifyUpdate;
  pFunctionList->C_GenerateKey  = STSAFE_P11_GenerateKey;
  pFunctionList->C_GenerateKeyPair = STSAFE_P11_GenerateKeyPair;
  pFunctionList->C_WrapKey  = STSAFE_P11_WrapKey;
  pFunctionList->C_UnwrapKey  = STSAFE_P11_UnwrapKey;
  pFunctionList->C_DeriveKey = STSAFE_P11_DeriveKey;
  pFunctionList->C_SeedRandom  = STSAFE_P11_SeedRandom;
  pFunctionList->C_GenerateRandom = STSAFE_P11_GenerateRandom;
  pFunctionList->C_GetFunctionStatus  = STSAFE_P11_GetFunctionStatus;
  pFunctionList->C_CancelFunction  = STSAFE_P11_CancelFunction;
  pFunctionList->C_WaitForSlotEvent  = STSAFE_P11_WaitForSlotEvent;

  return ck_rv_ret_status;
}

/**
  * @brief  SessionInit initialize all the sessions.
  * @retval CK_RV CKR_OK.
  */
static CK_RV    SessionInit(void)
{
  uint32_t i;

