MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  ulSessionNb = 0;

  /* Initialize the Session List */
  for (i = 0 ; i < STSAFE_P11_NB_SESSIONS_MAX; i++)
  {
    a_SessionList[i].SessionHandle = CK_INVALID_HANDLE;
  }

  return CKR_OK;
}


/**
  * @brief  Open a session.
  * @param  slotID     the slot's ID
  * @param  flags     from CK_SESSION_INFO
  * @param  pApplication     passed to callback
  * @param  Notify     callback function
  * @param  phSession     gets session handle
  * @retval CK_RV CKR_SESSION_COUNT, CKR_OK.
  */
static CK_RV    SessionOpen(CK_SLOT_ID slotID, CK_FLAGS flags, CK_VOID_PTR pApplication,  CK_NOTIFY Notif,
                            CK_SESSION_HANDLE_PTR phSession)
{

  CK_ULONG ul_session_index;

  /* Prevent unused argument(s) compilation warning */
  UNUSED(pApplication);
  UNUSED(Notif);

  /* Check if the max number of sessions open at the same time was reached.  */
  if (ulSessionNb >=  STSAFE_P11_NB_SESSIONS_MAX)
  {
    return CKR_SESSION_COUNT;
  }

  /* Find the next available slot for a Session */
  ul_session_index = 0;

  do
  {
    if (a_SessionList[ul_session_index].SessionHandle == CK_INVALID_HANDLE)
    {
      break;
    }
    ul_session_index++;
  } while (ul_session_index < STSAFE_P11_NB_SESSIONS_MAX);

  /* Slot is found */
  if ((ul_session_index < STSAFE_P11_NB_SESSIONS_MAX) &&
      (a_SessionList[ul_session_index].SessionHandle == CK_INVALID_HANDLE))
  {
    a_SessionList[ul_session_index].SessionInfo.slotID = slotID;
    a_SessionList[ul_session_index].SessionHandle = ul_session_index + STSAFE_P11_SESSION_INDEX_OFFSET;
    /* A session can have only one crypto mechanism on going at a time. */
    a_SessionList[ul_session_index].OperationActive  = CK_FALSE;
    /* Reset all operations data */
    (void)memset(a_SessionList[ul_session_index].OperationObjects, CK_INVALID_HANDLE,
                 sizeof(CK_OBJECT_HANDLE) * sizeof(a_SessionList[ul_session_index].OperationObjects) /
                 (sizeof(a_SessionList[ul_session_index].OperationObjects[0U])));
    a_SessionList[ul_session_index].ulOperationObjectsCount = 0UL;

    /* Increment the session counter */
    ulSessionNb++;

    /*Prepare Session Handle*/
    *phSession = a_SessionList[ul_session_index].SessionHandle;

    return CKR_OK;
  }
  else
  {
    return CKR_SESSION_COUNT;
  }
}

/**
  * @brief  Closes a session.
  * @param  hSession     the session handle
  * @retval CK_RV CKR_OK
  */

static CK_RV    SessionClose(CK_SESSION_HANDLE hSession)
{

  CK_ULONG ul_session_index;

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /* Close the Session */
  a_SessionList[ul_session_index].SessionHandle = CK_INVALID_HANDLE;
  (void)memset(&(a_SessionList[ul_session_index].SessionInfo), 0U, sizeof(CK_SESSION_INFO));
  a_SessionList[ul_session_index].OperationActive = CK_FALSE;
  /* Reset all operations data */
  (void)memset(a_SessionList[ul_session_index].OperationObjects, CK_INVALID_HANDLE,
               sizeof(CK_OBJECT_HANDLE) * sizeof(a_SessionList[ul_session_index].OperationObjects) /
               (sizeof(a_SessionList[ul_session_index].OperationObjects[0U])));
  a_SessionList[ul_session_index].ulOperationObjectsCount = 0UL;

  /* Decrement the session counter */
  ulSessionNb--;

  return CKR_OK;

}

/**
  * @brief  Checks if the session is valid.
  * @param  hSession     the session handle
  * @retval CK_RV CKR_SESSION_HANDLE_INVALID, CKR_OK.
  */
static CK_RV    SessionIsValid(CK_SESSION_HANDLE hSession)
{
  CK_ULONG ul_session_index;

  /*Check input parameters*/
  if ((hSession == CK_INVALID_HANDLE) || (hSession < STSAFE_P11_SESSION_INDEX_OFFSET))
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /* Check if session handle is valid*/
  if ((ul_session_index > ulSessionNb) ||
      (ul_session_index > STSAFE_P11_NB_SESSIONS_MAX))
  {
    return   CKR_SESSION_HANDLE_INVALID;
  }

  return   CKR_OK;
}

/**
  * @brief  Checks if the session is open.
  * @param  hSession     the session handle
  * @retval CK_RV CKR_SESSION_HANDLE_INVALID, CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV    SessionIsOpen(CK_SESSION_HANDLE hSession)
{
  CK_ULONG ul_session_index;

  /*Check input parameters*/
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /* Check if session handle is valid and open*/
  if ((a_SessionList[ul_session_index].SessionHandle == CK_INVALID_HANDLE)
      || (a_SessionList[ul_session_index].SessionHandle != hSession))
  {
    return   CKR_GENERAL_ERROR;
  }

  return   CKR_OK;

}

/**
  * @brief  Checks if the session has an active operation.
  * @param  hSession     the session handle
  * @retval CK_RV CKR_SESSION_HANDLE_INVALID, CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV    SessionOperationIsActive(CK_SESSION_HANDLE hSession)
{
  CK_ULONG ul_session_index;

  /*Check input parameters*/
  if (SessionIsValid(hSession) != CKR_OK)
  {
    return CKR_SESSION_HANDLE_INVALID;
  }

  /*Adapt Session handle to session index*/
  ul_session_index = hSession - STSAFE_P11_SESSION_INDEX_OFFSET;

  /*Check if operation is tagged as active*/
  if (a_SessionList[ul_session_index].OperationActive == CK_FALSE)
  {
    return CKR_GENERAL_ERROR;
  }

  return CKR_OK;
}


/**
  * @brief  Initialize an operation for a session.
  * @param  hSession     the session handle
  * @param  pTemplate     the operation template
  * @param  ulCount     attributes in template
  * @param  Mechanism     the operation mechanism
  * @retval CK_RV CKR_ARGUMENTS_BAD, CKR_SESSION_HANDLE_INVALID, CKR_OK.
  */
static CK_RV    SessionOperationSetObjects(CK_SESSION_HANDLE hSession, CK_OBJECT_HANDLE_PTR pObject, CK_ULONG ulCount)
{
  CK_ULONG ul_session_index;

  /*Check input parameters*/
  if (ulCount == 0UL)
  {
    return CKR_ARGUMENTS_BAD;
  }

