MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
        /* Read a certificate from STSAFE zone */
        /* Note: in this implementaiton the assumption is that STSAFE zones contain only certificates, one
                certificate per zone. */
        if (StSafeReadCertificate(pValue, (uint32_t *)pulValueLen, zone, access_condition) != STSAFEA_OK)
        {
          e_ret_status = CKR_FUNCTION_FAILED;
        }
        else
        {
          e_ret_status = CKR_OK;
        }
      }
      else
      {
        e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
      }
    }
    else
    {
      e_ret_status = CKR_ATTRIBUTE_TYPE_INVALID;
    }
  }
  else
  {
    /* Attribute value is stored locally : Retrieve the value from embedded object */
    e_ret_status = STSAFE_OBJ_GetAttributeValue(pValue, pulValueLen, p_attribute);
  }

  return e_ret_status;
}

/**
  * @brief  Check if the attribute is sensitive.
  * @param  Type    attribute to check.
  * @param  pTemplate  template to look for the attribute
  * @param  ulCount    number of attributes in the template.
  * @retval CK_BBOOL CK_TRUE, CK_FALSE.
  */
static CK_BBOOL IsAttributeSensitive(CK_ATTRIBUTE_TYPE Type, CK_ATTRIBUTE_PTR pTemplate, CK_ULONG ulCount)
{
  CK_BBOOL sensitive, cka_extractable, cka_sensitive;
  CK_OBJECT_CLASS obj_class;
  CK_ATTRIBUTE_PTR p_attribute_tmp;

  /* Extract CKA_CLASS attribute from the template */
  if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_CLASS, pTemplate, ulCount) != CKR_OK)
  {
    /*If object class is not recognized, the object is considered sensitive*/
    sensitive = CK_TRUE;
  }
  else
  {
    obj_class = (*((CK_OBJECT_CLASS *)(p_attribute_tmp->pValue)));

    /* Check sensitive depending on the object class */
    switch (obj_class)
    {
      case CKO_PRIVATE_KEY:

        /*set default values*/
        cka_sensitive = CK_TRUE;
        cka_extractable = CK_FALSE;

        /* Check CKA_SENSITIVE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_SENSITIVE, pTemplate, ulCount) == CKR_OK)
        {
          cka_sensitive = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check CKA_EXTRACTABLE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXTRACTABLE, pTemplate, ulCount) == CKR_OK)
        {
          cka_extractable = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check the attributes with two configuration lists depending on the attributes of
         * CKA_SENSITIVE or CKA_EXTRACTABLE*/
        if ((cka_sensitive == CK_TRUE) || (cka_extractable == CK_FALSE))
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoPrivateKey_NotExtr,
                                            SensAttList_CkoPrivateKey_NotExtrLen);
        }
        else
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoPrivateKey_Extr,
                                            SensAttList_CkoPrivateKey_ExtrLen);
        }

        break;

      case CKO_SECRET_KEY:
        /*set default values*/
        cka_sensitive = CK_TRUE;
        cka_extractable = CK_FALSE;

        /* Check CKA_SENSITIVE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_SENSITIVE, pTemplate, ulCount) == CKR_OK)
        {
          cka_sensitive = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /* Check CKA_EXTRACTABLE attribute */
        if (STSAFE_OBJ_FindAttributeInTemplate(&p_attribute_tmp, CKA_EXTRACTABLE, pTemplate, ulCount) == CKR_OK)
        {
          cka_extractable = (*((CK_BBOOL *)(p_attribute_tmp->pValue)));
        }

        /*Check the attributes with two configuration lists depending on the attributes of CKA_SENSITIVE or
        CKA_EXTRACTABLE*/
        if ((cka_sensitive == CK_TRUE) || (cka_extractable == CK_FALSE))
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoSecretKey_NotExtr,
                                            SensAttList_CkoSecretKey_NotExtr);
        }
        else
        {
          sensitive = IsAttributeTypeInList(Type, a_SensAttList_CkoSecretKey_Extr,
                                            SensAttList_CkoSecretKey_ExtrLen);
        }
        break;

      case CKO_PUBLIC_KEY:
        /* CKO_PUBLIC_KEY objects are extractable by definition, they don't have CKA_EXTRACTABLE attribute*/
        sensitive = IsAttributeTypeInList(Type, a_SensitiveAttributesList_CkoPublicKey,
                                          SensitiveAttributesList_CkoPublicKeyLen);
        break;

      case CKO_CERTIFICATE:
        /* CKO_CERTIFICATE objects are extractable by definition, they don't have CKA_EXTRACTABLE attribute*/
        sensitive = IsAttributeTypeInList(Type, a_SensitiveAttributesList_CkoCertificate,
                                          SensitiveAttributesList_CkoCertificateLen);
        break;

      default:
        /*If object is not known - sensitive is true */
        sensitive = CK_TRUE;
        break;
    }
  }


  return sensitive;
}


/**
  * @brief  Read the content of a zone from STSAFE.
  * @param  ulZone     zone number.
  * @param  ulOffset     offset from where to start reading.
  * @param  pucData     gets the Data value.
  * @param  ulDataSize     data len.
  * @param  AccessCondition     type of access condition.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV StSafeReadZone(uint8_t uZone, uint32_t ulOffset, uint8_t *pucData, uint32_t ulDataSize,
                            uint8_t AccessCondition)
{
  StSafeA_LVBuffer_t read_buffer;
  uint32_t index;
  uint32_t tmp_len;
  uint32_t tmp_offset;

  tmp_len = ulDataSize;
  tmp_offset = ulOffset;

  index = 0UL;

  /*Split the read in multiple chunks considering the limit of ST-SAFE DATA CONTENT size buffer */
  while (tmp_len >= STSAFEA_BUFFER_DATA_CONTENT_SIZE)
  {
    /* Read from STSAFE partition */
    if (StSafeA_Read(&hStSafe, 0U, 0U, STSAFEA_AC_ALWAYS, uZone, (uint16_t)tmp_offset,
                     (uint16_t)STSAFEA_BUFFER_DATA_CONTENT_SIZE, &read_buffer, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /* Assign to output buffer if !=NULL*/
    if (pucData != NULL_PTR)
    {
      (void)memcpy(&pucData[index], read_buffer.Data, read_buffer.Length);
      index += STSAFEA_BUFFER_DATA_CONTENT_SIZE;
    }

    /* Update offset and len */
    tmp_offset += STSAFEA_BUFFER_DATA_CONTENT_SIZE;
    tmp_len -= STSAFEA_BUFFER_DATA_CONTENT_SIZE;
  }

  /*Update the last chunk*/
  if (tmp_len != 0UL)
  {
    /* Read from STSAFE partition */
    if (StSafeA_Read(&hStSafe, 0U, 0U, STSAFEA_AC_ALWAYS, uZone, (uint16_t)tmp_offset, (uint16_t)tmp_len,
                     &read_buffer, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }

    /* Assign to output buffer if !=NULL*/
    if (pucData != NULL_PTR)
    {
      (void)memcpy(&pucData[index], read_buffer.Data, tmp_len);
    }
  }

  return CKR_OK;
}

/**
  * @brief  Read Certificate from STSAFE.
  * @param  pValue     gets the Data value.
  * @param  pulValueLen     data len.
  * @param  Zone     gets the Data value.
  * @param  AccessCondition     type of access condition.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV StSafeReadCertificate(uint8_t *pValue, uint32_t *pulValueLen, uint8_t Zone, uint8_t AccessCondition)
{
  CK_BYTE a_sequence_header[4U];
  CK_ULONG ul_cert_len = 0UL;

  /* Check input parameters */
  if (pulValueLen == NULL_PTR)
  {
    return CKR_GENERAL_ERROR;
  }

  /* Read Certificate header */
  if (StSafeReadZone(Zone, 0U, a_sequence_header, sizeof(a_sequence_header), AccessCondition) != STSAFEA_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /* Parse the header and extract certificate len*/
  if (GetLenDerASN1SequenceHeader(&ul_cert_len, a_sequence_header, sizeof(a_sequence_header)) != CKR_OK)
  {
    return CKR_GENERAL_ERROR;
  }

  /*Copy value out only if pointer is != NULL_PTR*/
  /*No need to read the actual certificate if pointer is null*/
  if (pValue != NULL_PTR)
  {
    if (StSafeReadZone(Zone, 0U, pValue, ul_cert_len, AccessCondition) != STSAFEA_OK)
    {
      return CKR_GENERAL_ERROR;
    }
  }

  /* Copy valueLen out */
  *pulValueLen = ul_cert_len;

  return CKR_OK;
}

/**
  * @brief  Get Len value from ASN1 Sequence header.
  * @note: this implementation supports only Sequence with Len field <=0x82
  * @param  pulValueOutLen     sequence len.
  * @param  pValueIn     ASN1 Sequence header.
  * @param  ulValueInLen     data len.
  * @retval CK_RV CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV GetLenDerASN1SequenceHeader(CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn, CK_ULONG ulValueInLen)
{
  CK_RV e_ret_status;

