MouFei1994/Sercure-Boot/STM32CubeExpansion_SBSFU_V2.3.0/Projects/B-L475E-IOT01A/Applications/2_Images_STSAFE/2_Images_SECoreBin/Src/kms_ext_token_stsafe.c
  /*Check input parameters*/
  if ((pValueIn == NULL_PTR) || (ulValueInLen == 0UL) || (pulValueOutLen == NULL_PTR))
  {
    return CKR_GENERAL_ERROR;
  }

  /* Check ASN SEQUENCE TAG */
  if (pValueIn[0U] != ASN_SEQUENCE)
  {
    return CKR_GENERAL_ERROR;
  }

  /*Init*/
  e_ret_status = CKR_OK;

  /* Check Length */
  if ((pValueIn[1U] <= ASN_LONG_LEN) && (ulValueInLen >= 2U))
  {
    *pulValueOutLen = pValueIn[1U];

  }
  else if (((pValueIn[1U] == (ASN_LONG_LEN + 1U)) && (ulValueInLen >= 3U)))
  {
    *pulValueOutLen = pValueIn[2U] + 3UL;

  }
  else if (((pValueIn[1U] == (ASN_LONG_LEN + 2U)) && (ulValueInLen >= 4U)))
  {
    *pulValueOutLen = ((uint32_t)pValueIn[2U] << 8UL);
    *pulValueOutLen += pValueIn[3U];
    *pulValueOutLen += 4UL;

  }
  else
  {
    /*Note: this implementation supports only Sequence with Len field <=0x82*/
    e_ret_status = CKR_GENERAL_ERROR;
  }

  return e_ret_status;
}

/**
  * @brief  Decodes a raw octect string.
  * @note:  Raw octect string format: 0x04 | Len | Data.
  *         Example:
  *           |  04 0a                              ; OCTET_STRING (a Bytes)
  *           |     1e 08 00 55 00 73 00 65  00 72  ;   ...U.s.e.r
  *           If the byte array contains fewer than 128 bytes, the Length field
  *           of the TLV triplet requires only one byte to specify the content length.
  *           If it is more than 127 bytes, bit 7 of the Length field is set to 1 and
  *           bits 6 through 0 specify the number of additional bytes used to identify
  *           the content length.
  *           This implementation does NOT support long length octects
  *           ( i.e. Length field > 128 (0x80)).
  * @param  pValueOut        gets the raw data.
  * @param  pulValueOutLen   gets the raw data len.
  * @param  pValueIn         Raw OCTECT String.
  * @param  ulValueInLen     Raw OCTECT String Len.
  * @retval CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV DecodeDerASN1OctetString(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn,
                                      CK_ULONG ulValueInLen)
{
  uint32_t i = 0;
  uint32_t header_len = 0;

  /* Check input parameters */
  if ((pValueIn == NULL_PTR) || (ulValueInLen == 0))
  {
    return CKR_GENERAL_ERROR;
  }

  /* Check ASN OCTET STRING TAG */
  if (pValueIn[i++] != ASN_OCTET_STRING)
  {
    return CKR_GENERAL_ERROR;
  }

  header_len++;

  /* Check Length*/
  /* Note: This implementation does NOT support long length octects ( i.e. Length field > 128 (0x80)).*/
  if (pValueIn[i] >= ASN_LONG_LEN)
  {
    return CKR_GENERAL_ERROR;
  }

  header_len++;

  /* Check len field is consistent with the actual length */
  if (pValueIn[i++] != (ulValueInLen - header_len))
  {
    return CKR_GENERAL_ERROR;
  }

  /* Assign output len*/
  *pulValueOutLen = ulValueInLen - header_len;

  /* Assign output*/
  if (pValueOut != NULL_PTR)
  {
    (void)memcpy(pValueOut, &pValueIn[header_len], *pulValueOutLen) ;
  }

  return CKR_OK;
}

/**
  * @brief  Decodes a DER x9.62 EC Point to raw data X and Y coordinates.
  * @note:  DER-encoded x9.62 EC Point format: 0x04 | Len | 0x04 | X | Y.
  *         Example:
  *           |  04 41                              ; OCTET_STRING (a Bytes)
  *           |     04                              ; UNCOMPRESSED DER
  *           |     0x93, 0x5B, 0x79, 0xC5, 0xC3,   ; X and Y coordinates
  *           |     ....                            ;
  *           |     0xE6, 0xC7, 0x5C, 0x04, 0x96    ;
  *           This implementation does NOT support long length octects
  *           ( i.e. Len field > 128 (0x80)).
  * @param  pValueOut     gets the raw data.
  * @param  pulValueOutLen     gets the raw data len.
  * @param  pValueIn     DER x962 point.
  * @param  ulValueInLen     DER x962 point len.
  * @retval CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV DecodeDerASN1UncompressedEcPoint(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen, CK_BYTE_PTR pValueIn,
                                              CK_ULONG ulValueInLen)
{
  uint32_t i = 0;
  CK_ULONG header_len = 0;

  /* Decode DER Encoded ASN1 Octect String */
  /* Check input parameters */
  if ((pValueIn == NULL_PTR) || (ulValueInLen == 0))
  {
    return CKR_GENERAL_ERROR;
  }

  /* Check ASN OCTET STRING TAG */
  if (pValueIn[i++] != ASN_OCTET_STRING)
  {
    return CKR_GENERAL_ERROR;
  }

  header_len++;

  /* Check Length*/
  /* Note: This implementation does NOT support long length octects ( i.e. Length field > 128 (0x80)).*/
  if (pValueIn[i] >= ASN_LONG_LEN)
  {
    return CKR_GENERAL_ERROR;
  }

  header_len++;

  /* Check len field is consistent with the actual length */
  if (pValueIn[i++] != (ulValueInLen - header_len))
  {
    return CKR_GENERAL_ERROR;
  }

  /* DER_UNCOMPRESSED OCTET TAG  */
  if (pValueIn[i] != DER_UNCOMPRESSED)
  {
    return CKR_GENERAL_ERROR;
  }

  header_len++;

  /* Assign output len - Remove DER UNCOMPRESSED TAG (0x04)*/
  *pulValueOutLen = ulValueInLen - header_len;

  /* Assign output*/
  if (pValueOut != NULL_PTR)
  {
    (void)memcpy(pValueOut, &pValueIn[header_len], *pulValueOutLen) ;
  }

  return CKR_OK;
}


/**
  * @brief  Encodes raw EC Point data to DER x9.62 EC point.
  * @note:  DER-encoded x9.62 EC Point format: 0x04 | Len | 0x04 | X | Y.
  *         Example:
  *           |  04 41                              ; OCTET_STRING (a Bytes)
  *           |     04                              ; UNCOMPRESSED DER
  *           |     0x93, 0x5B, 0x79, 0xC5, 0xC3,   ; X and Y coordinates
  *           |     ....                            ;
  *           |     0xE6, 0xC7, 0x5C, 0x04, 0x96    ;
  * @param  pValueOut     gets the DER x962 point.
  * @param  pulValueOutLen     gets the DER x962 point len.
  * @param  pValueIn     raw data X and Y coordinates.
  * @param  ulValueInLen     raw data X and Y coordinates len.
  * @retval CKR_GENERAL_ERROR, CKR_OK.
  */
static CK_RV EncodeRawToDerASN1UncompressedEcPoint(CK_BYTE_PTR pValueOut, CK_ULONG_PTR pulValueOutLen,
                                                   CK_BYTE_PTR pValueIn, CK_ULONG ulValueInLen)
{
  uint32_t i = 0;

  /* Check input parameters */
  if ((pulValueOutLen == NULL_PTR) || (pValueIn == NULL_PTR) || (ulValueInLen == 0))
  {
    return CKR_GENERAL_ERROR;
  }

  if (ulValueInLen >= ASN_LONG_LEN)
  {
    return CKR_GENERAL_ERROR;
  }

  /*output len*/
  *pulValueOutLen = ulValueInLen + 2UL + 1UL;

